#스캐너의 여러가지 출력기능 정의한 페이지

# 스캐너의 환영 메시지를 출력하는 함수
def print_welcome_message():
    # 여러 줄의 문자열을 사용하여 환영 메시지를 정의합니다. 이 메시지에는 아스키 아트와 환영 문구가 포함되어 있습니다.
    welcome_message = """
────────────────────────────────────────────────────────────────────────────────────────────────────
───────────░▓░────░█░─▒█──────────────────█▒─────────────────▓█─────────────────────────────────────
───────────░█░────░█░─▒█─────▓▓▓▓▓▓▓▓▒────█▒─────█████████▓──▓█───────░░░░░░░░░░░░░░────────────────
───────────░█░────░█░─▒█─────█████████────█▒─────────█░──────▓█───────██████████████────────────────
───────░█████████▒░█░─▒█────────────█▒────█▒─────────█▓──────▓█─────────────██──────────────────────
───────░█████████▒░█░─▒█───────────░█▒────█▒────────▓██──────▓█─────────────██──────────────────────
──────────────────░█░─▒█───────────░█─────█▒────────█▓█▒─────▓████─────────▓███─────────────────────
──────────▓████───░█░─▒█───░█████████─────█▒───────██─▓█░────▓█───────────▒█░░█▒────────────────────
─────────██▓─▒██░─░█░─▒█────▓▓▒───▒█░▓█████▒──────▓█░──██▒───▓█──────────▓█▒──▒██░──────────────────
────────░█─────█▒─░█░░▒█─────────░██─▓█████▒────░██─────░██──▓█────────░██──────██▓░────────────────
────────██─────██─░█████─────────██───────█▒────░█───────░░──░░──────███▒────────░███───────────────
────────██─────██─░█░─▒█────────██░───────█▒───────▓▓────────▒▓───────▒─────██─────▒░───────────────
────────▒█─────█▓─░█░─▒█──────░██░────────█▒───────██────────▓█─────────────██──────────────────────
─────────██░─░██░─░█░─▒█─────▓██──────────█▒───────██────────▓█─────────────██──────────────────────
──────────█████───░█░─▒█────██▓───────────█▒───────████████████─────────────██──────────────────────
───────────░░░────░█░─▒█─────░────────────█▒───────██░░░░░░░░▓█─────▓█████████████████──────────────
──────────────────░█░─▒█──────────────────█▒───────██────────▓█─────██████████████████──────────────
──────────────────░█░─▒█──────────────────█▒───────██────────▓█─────────────────────────────────────
──────────────────░█░─▒█──────────────────█▒───────████████████─────────────────────────────────────
───────────────────░──▒█──────────────────█▒───────░░░░░░░░░░░░─────────────────────────────────────

    Welcome to CatchHacker Scanner!

    """
    print(welcome_message)  # 정의된 환영 메시지를 콘솔에 출력합니다.

# 포트 스캔 결과를 출력하는 함수
def port_result_printing(thread_ids, filtered_ports, closed_ports, open_ports):
    #closed_ports.sort()  # 닫힌 포트 목록을 오름차순으로 정렬합니다.
    #open_ports.sort()  # 열린 포트 목록을 오름차순으로 정렬합니다.

    # 열린 포트 목록을 출력합니다. 포트 번호를 문자열로 변환하고, 각 포트 번호 사이에 쉼표와 공백을 추가하여 출력합니다.
    print("\nOpen ports:")
    print(', '.join(map(str, open_ports)))

    # 닫힌 포트 목록과 필터링된 포트 목록의 출력은 주석 처리되어 있어, 기본적으로 출력되지 않습니다.

    # 열린 포트, 닫힌 포트, 필터링된 포트의 총 개수를 출력합니다.
    print(f"\nTotal open ports: {len(open_ports)}")
    print(f"Total closed ports: {len(closed_ports)}")
    print(f"Total filtered ports: {len(filtered_ports)}")

# 사전(dictionary) 형태의 데이터를 출력하는 함수
def print_dict(dictionary):
    # 사전의 각 항목(키와 값)에 대해 반복합니다.
    for key, value in dictionary.items():
        # 각 키와 값을 콜론과 함께 출력합니다.
        print(f"{key}: {value}")

# 서비스 스캔 결과를 출력하는 함수
def service_result_printing(Detected_service, Closed_service, Not_Detected_service):
    # 감지된 서비스, 닫힌 서비스, 감지되지 않은 서비스 목록을 출력합니다.
    print("\nDetected_service:")
    print(Detected_service)  # 감지된 서비스 목록을 출력합니다.

    print("\nClosed_service:")
    print(Closed_service)  # 닫힌 서비스 목록을 출력합니다.

    # 감지되지 않은 서비스 목록을 출력합니다. 포트 번호를 문자열로 변환하고, 각 포트 번호 사이에 쉼표와 공백을 추가하여 출력합니다.
    print("\nNot_Detected_service port")
    print(', '.join(map(str, Not_Detected_service)))
    
    # 감지된 서비스, 닫힌 서비스, 감지되지 않은 서비스의 총 개수를 출력합니다.
    print(f"\nTotal open services: {len(Detected_service)}")
    print(f"Total closed services: {len(Closed_service)}")
    print(f"Total not detected services: {len(Not_Detected_service)}")